In [1]:
import numpy as np
import pandas as pd

In [3]:
obj = pd.Series(range(4), index = ['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [4]:
obj.sort_index()
obj

d    0
a    1
b    2
c    3
dtype: int64

In [5]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)),index=['three', 'one'], columns = ['d', 'a', 'b', 'c'])
frame.sort_index()
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [6]:
frame.sort_index(axis=1)
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [7]:
frame.sort_index(axis=1, ascending=False)
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [12]:
obj = pd.Series([4,7,-3,2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [11]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [13]:
frame = pd.DataFrame({'b' : [4,7,-3,2], 'a' : [0,1,0,1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [14]:
frame.sort_values(by = ['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [15]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [16]:
obj.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64